docs/03_modelagem_uml.md
```mermaid
classDiagram
direction LR

class Usuario {
  +id: UUID
  +nome: string
  +email: string
  +telefone: string
  +senhaHash: string
  +ativo: bool
  +perfil: string
}

class Paciente {
  +cpf: string
  +dataNascimento: date
  +endereco: string
  +consentimentoLGPD: bool
}

class Profissional {
  +tipo: string
  +registroConselho: string
  +especialidade: string
}

class Administrador {
  +nivelAcesso: string
}

class Consulta {
  +id: UUID
  +dataHora: datetime
  +tipo: enum /* Presencial, Telemedicina */
  +status: enum /* Agendada, Cancelada, Concluída */
}

class Prontuario {
  +id: UUID
  +diagnostico: string
  +observacoes: text
  +dataRegistro: datetime
  +versao: int
}

class Prescricao {
  +id: UUID
  +medicamento: string
  +dosagem: string
+assinaturaDigital: string
  +validade: date
}

class Leito {
  +id: UUID
  +numero: string
  +status: enum /* Livre, Ocupado, Manutenção */
}

class Internacao {
  +id: UUID
  +dataEntrada: datetime
  +dataAlta: datetime
  +status: enum /* Ativa, Alta */
}

class Suprimento {
  +id: UUID
  +nome: string
  +estoqueAtual: number
  +estoqueMinimo: number
}

class Auditoria {
  +id: UUID
  +usuario: string
  +acao: string
  +timestamp: datetime
  +ip: string
  +sucesso: bool
}

Usuario <|-- Paciente
Usuario <|-- Profissional
Usuario <|-- Administrador
Paciente "1" --> "*" Consulta
Profissional "1" --> "*" Consulta
Consulta "1" --> "1" Prontuario
Prontuario "1" --> "*" Prescricao
Administrador "1" --> "*" Auditoria
Administrador "1" --> "*" Suprimento
Administrador "1" --> "*" Leito
Leito "1" --> "*" Internacao
```
